In [1]:
import pandas as pd
import numpy as np

In [2]:
Dict = {"Age": pd.Series([25, 30, 35], index=["Sylvie", "Gilles", "Sylvain"]),
         "Ville": pd.Series(["Lorient", "Angers", "Vannes", "Le Mans"], index=["Sylvie", "Gilles", "Sylvain", "Thomas"])}

In [3]:
df = pd.DataFrame(Dict)
df

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas    NaN  Le Mans

In [4]:
type(df)

type(df["Ville"])

df.index #colonnes des clés

df.columns # nom des en-tetes

Index(['Age', 'Ville'], dtype='object')

In [5]:
Dict = {"Prénom": ["Sylvie", "Gilles", "Sylvain", "Thomas"], "Age": [25, 30, 35, 40]}

df = pd.DataFrame(Dict) #sans précision les index par defaut sont appliqués

df

df = pd.DataFrame(Dict, index=["L1", "L2","L3","L4"])
df

     Prénom  Age
L1   Sylvie   25
L2   Gilles   30
L3  Sylvain   35
L4   Thomas   40

In [6]:
DF = pd.DataFrame(Dict, index = range(1, 5))
DF

    Prénom  Age
1   Sylvie   25
2   Gilles   30
3  Sylvain   35
4   Thomas   40

In [7]:
Dict = {"Age": pd.Series([25, 30, 35], index=["Sylvie", "Gilles", "Sylvain"]),
         "Ville": pd.Series(["Lorient", "Angers", "Vannes", "Le Mans"], index=["Sylvie", "Gilles", "Sylvain", "Thomas"])}

In [8]:
df = pd.DataFrame(Dict)
df

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas    NaN  Le Mans

In [9]:
df["Age"]

Gilles     30.0
Sylvain    35.0
Sylvie     25.0
Thomas      NaN
Name: Age, dtype: float64

In [10]:
df.Age

Gilles     30.0
Sylvain    35.0
Sylvie     25.0
Thomas      NaN
Name: Age, dtype: float64

In [17]:
print(df)
print("**************")
print(df.loc['Gilles'])
print("**************")
print(df.iloc[1])
print("**************")
print(df["Ville"]["Sylvie"])
print("**************")
df["Ville"].loc["Sylvie"]
print("**************")
df["Ville"].iloc[2]
print("**************")
df["Age"].loc["Thomas"] = 36
df

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas   25.0  Le Mans
**************
Age        30.0
Ville    Angers
Name: Gilles, dtype: object
**************
Age        35.0
Ville    Vannes
Name: Sylvain, dtype: object
**************
Lorient
**************
**************
**************

/tmp/ipykernel_11728/2814079575.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Age"].loc["Thomas"] = 36

          Age    Ville
Gilles   30.0   Angers
Sylvain  35.0   Vannes
Sylvie   25.0  Lorient
Thomas   36.0  Le Mans

In [18]:
df_notes = pd.DataFrame({
         "Big data":  pd.Series([11.0, 15.0, 10.0,10.0], index=["Sylvie", "Gilles", "Sylvain", "Thomas"]),
         "Hadoop": pd.Series([18.0, 20.0, 17.0,18.0], index=["Sylvie", "Gilles", "Sylvain", "Thomas"]),
         "Spark": pd.Series([15.0, 7.0, 10.0,20.0], index=["Sylvie", "Gilles", "Sylvain", "Thomas"]),
         "Java": pd.Series([18.0, 20.0, 10.0,8.0], index=["Sylvie", "Gilles", "Sylvain", "Thomas"])})
df_notes

         Big data  Hadoop  Spark  Java
Sylvie       11.0    18.0   15.0  18.0
Gilles       15.0    20.0    7.0  20.0
Sylvain      10.0    17.0   10.0  10.0
Thomas       10.0    18.0   20.0   8.0

In [21]:
df_notes.mean(axis=0) #moyenne sur les lignes par defaut

Sylvie     15.50
Gilles     15.50
Sylvain    11.75
Thomas     14.00
dtype: float64

In [23]:
df_notes.mean(axis=1)  #moyenne sur les colonnes

Sylvie     15.50
Gilles     15.50
Sylvain    11.75
Thomas     14.00
dtype: float64

In [24]:
df_notes.mean(axis=0).mean()

14.1875

In [26]:
df_notes.min(axis=0) # pour avoir la plus faibleote dans les matieres

df_notes.min(axis=1) #pour avoir la plus petite note par individus

Sylvie     11.0
Gilles      7.0
Sylvain    10.0
Thomas      8.0
dtype: float64

In [30]:
#Statistque descriptive
df_notes.describe()

        Big data     Hadoop      Spark       Java
count   4.000000   4.000000   4.000000   4.000000
mean   11.500000  18.250000  13.000000  14.000000
std     2.380476   1.258306   5.715476   5.887841
min    10.000000  17.000000   7.000000   8.000000
25%    10.000000  17.750000   9.250000   9.500000
50%    10.500000  18.000000  12.500000  14.000000
75%    12.000000  18.500000  16.250000  18.500000
max    15.000000  20.000000  20.000000  20.000000

In [33]:
df_notes

         Big data  Hadoop  Spark  Java
Sylvie       11.0    18.0   15.0  18.0
Gilles       15.0    20.0    7.0  20.0
Sylvain      10.0    17.0   10.0  10.0
Thomas       10.0    18.0   20.0   8.0

In [37]:
#les masques en python
df_notes["Java"] >= 15
print("**************")
df_notes[df_notes["Java"]>=15]

#print("**************")
#df_notes[df_notes["Java"]>=15]["Java"]

**************

        Big data  Hadoop  Spark  Java
Sylvie      11.0    18.0   15.0  18.0
Gilles      15.0    20.0    7.0  20.0

In [ ]:
print("**************")
df_notes[(df_notes["Java"]>=15) & (df_notes["Spark"]>=10) ]